[
  {
    "name": "АМА-сессия «Service mesh 2021» 17 февраля",
    "url": "https://habr.com/ru/company/southbridge/news/t/541766/",
    "id": "541766",
    "text": "\n\r\n17 февраля Слёрм проведёт АМА-сессию по service mesh. Рекомендуем оставить свои вопросы заранее, через форму регистрации на сайте.\n\nО мероприятии\r\nЭксперты будут отвечать на самые популярные вопросы по технологии service mesh и вопросы участников мероприятия. Помогут понять, насколько service mesh может решить ваши задачи. Нужна ли технология вашему проекту сейчас или никогда.\n"
  },
  {
    "name": "Apple предложит пользователям заменить аккумуляторы MacBook Pro 2016/2017",
    "url": "https://habr.com/ru/news/t/541976/",
    "id": "541976",
    "text": "\nApple запускает программу замены аккумуляторов для моделей MacBook Pro 2016 и 2017 годов выпуска. В ней могут принять учаcтие пользователи, у которых есть проблемы с работой батарей.\n"
  },
  {
    "name": "Вирусный фильтр «Я не кот» оказался устаревшим ПО",
    "url": "https://habr.com/ru/news/t/541960/",
    "id": "541960",
    "text": "\nВидео, на котором техасский адвокат появляется с «кошачьим» фильтром на онлайн-заседании суда в Zoom, а потом оправдывается за это, уже стало вирусным. Пользователи заинтересовались тем, как им получить такой же фильтр. Кто-то даже предположил, что юрист использовал дипфейк-технологию. Но на деле всё оказалось гораздо проще. \n"
  },
  {
    "name": "В языке Go наконец-то появятся дженерики. Proposal принят",
    "url": "https://habr.com/ru/news/t/541958/",
    "id": "541958",
    "text": "\nКак сообщает телеграм-канал Cross Join, предложение по добавлению дженериков в Go наконец-то приняли. \nСсылка на сам документ здесь: type parameters.\ntype Stringer interface {\n    String() string\n}\n\ntype Plusser interface {\n    Plus(string) string\n}\n\nfunc ConcatTo[S Stringer, P Plusser](s []S, p []P) []string {\n    r := make([]string, len(s))\n    for i, v := range s {\n        r[i] = p[i].Plus(v.String())\n    }\n    return r\n}\n"
  },
  {
    "name": "НАСА раздаст тысяче сотрудников устройства Fitbit, чтобы отследить распространение коронавируса",
    "url": "https://habr.com/ru/news/t/541952/",
    "id": "541952",
    "text": "\nНАСА выдаст тысяче своих сотрудников, включая 150 астронавтов, устройства Fitbit в рамках пилотной программы по сдерживанию распространения коронавируса.\n"
  },
  {
    "name": "Обновление Android Jetpack: Activity Result API и рефакторинг Fragment",
    "url": "https://habr.com/ru/news/t/541942/",
    "id": "541942",
    "text": "\nПривет! С вами Android Broadcast. Прошли 2 недели и очередной релиз библиотек Jetpack от Google уже с нами. Вышло долгожданное исправление множества багов в Fragment из-за рефакторинга внутри FragmentManager, Activity Result API и много другого. Все самое интересное вы найдете в статье, а все подробности можете найти на сайте\n"
  },
  {
    "name": "НАСА предложило искать признаки жизни на загрязненных планетах",
    "url": "https://habr.com/ru/news/t/541936/",
    "id": "541936",
    "text": "\nИсследование НАСА предлагает новый способ поиска внеземных цивилизаций. Агентство считает, что формы жизни потенциально могут присутствовать на тех планетах, где наблюдается атмосферное загрязнение. \n"
  },
  {
    "name": "ФАС возбудила дело против Tele2 за повышение тарифов",
    "url": "https://habr.com/ru/news/t/541932/",
    "id": "541932",
    "text": "\nФедеральная антимонопольная служба возбудила дело против оператора Tele2 за увеличение стоимости услуг связи для пользователей на 13% с 1 января 2021 года, говорится в пресс-релизе на сайте ведомства. Повышение цен на тарифы затронуло более 12 миллионов абонентов. \n"
  },
  {
    "name": "МВД запустило госзакупку на изучение способов борьбы с дипфейками",
    "url": "https://habr.com/ru/news/t/541910/",
    "id": "541910",
    "text": "\nИсточник фото: Вести.Hi-tech.\n\r\nВ начале февраля 2021 года МВД объявило на портале госзакупок тендер на проведение исследования возможных способов выявления признаков внутрикадрового монтажа видеоизображений, выполненного с помощью нейронных сетей. Проект получил шифр «Зеркало (Верблюд)». По итогам научных изысканий исполнитель должен будет составить техническое задание на разработку программно-аппаратного комплекса для борьбы с дипфейками.\n"
  },
  {
    "name": "Минцфиры планирует допустить в реестр отечественного ПО условно переработанные зарубежные программы",
    "url": "https://habr.com/ru/news/t/541912/",
    "id": "541912",
    "text": "\nРоссийским разработчикам не потребуется подтверждать «существенную переработку» зарубежных программ с открытым исходным кодом, чтобы попасть в список отечественного ПО. Об этом говорится в проекте поправок к постановлению правительства об импортозамещении ПО, которое подготовило Минцифры, сообщают «Ведомости». \n"
  },
  {
    "name": "В Россию ввезли крупнейшую партию оборудования для майнинга за $40–60 млн",
    "url": "https://habr.com/ru/news/t/541908/",
    "id": "541908",
    "text": "\nВ конце 2020 года в Россию ввезли крупнейшую в истории страны разовую партию майнингового оборудования. Его общая мощность составляет 70 МВт, а стоимость — $40–60 млн. Эксперты отметили, что это оборудование может обеспечить три месяца работы всего розничного рынка майнинга страны.  \n"
  },
  {
    "name": "Российский спектрометр обнаружил в атмосфере Марса хлороводород",
    "url": "https://habr.com/ru/news/t/541902/",
    "id": "541902",
    "text": "\nРоссийский спектрометр Atmospheric Chemistry Suite («Комплекс для изучения химии атмосферы», ACS) нашёл прямыми измерениями в атмосфере Марса хлороводород, сообщается на сайте «Роскосмоса». Ранее было известно о его присутствии лишь на двух планетах Солнечной системы — Земле и Венере. \n"
  },
  {
    "name": "Epic Games представила инструмент для создания персонажей MetaHuman Creator",
    "url": "https://habr.com/ru/news/t/541900/",
    "id": "541900",
    "text": "\nСтудия Epic Games представила инструмент MetaHuman Creator, который позволяет создавать реалистичные модели человеческих лиц с анимацией мимики на движке Unreal Engine прямо в браузере. Об этом сообщается в пресс-релизе на сайте компании. \n"
  },
  {
    "name": "Qualcomm представила 5G-модем со скоростью до 10 Гбит/с",
    "url": "https://habr.com/ru/news/t/541854/",
    "id": "541854",
    "text": "\nQualcomm анонсировала Snapdragon X65, модем 5G, который обеспечит скорости скачивания до 10 Гбит/с как в автономных, так и неавтономных сетях. У предшественника Х60 этот показатель не превышал 7,5 Гбит/с. \n"
  },
  {
    "name": "Украденные данные CD Projekt Red выставили на аукционе",
    "url": "https://habr.com/ru/news/t/541844/",
    "id": "541844",
    "text": "\n\n\r\nПо информации Telegram-канал «Утечки информации», злоумышленники выставят 10 февраля 2021 года на аукционе украденные данные студии CD Projekt Red, включая исходные коды Cyberpunk 2077 и «Ведьмака 3».\n"
  },
  {
    "name": "Пользователи PS5 жалуются на дрифт стиков на DualSense",
    "url": "https://habr.com/ru/news/t/541836/",
    "id": "541836",
    "text": "\nВладельцы PlayStation 5 массово жалуются на дрифт стиков у геймпадов DualSense. Причем, у некоторых такая проблема возникла менее чем через полмесяца после покупки консоли. Дрифт приводит к тому, что аналоговые стики неправильно регистрируют движения игрока и срабатывают даже без касания.  \n"
  },
  {
    "name": "Apple и TSMC вместе создадут технологию дисплеев следующего поколения для AR-очков и VR-гарнитур",
    "url": "https://habr.com/ru/news/t/541828/",
    "id": "541828",
    "text": "\n\n\r\nСогласно информации Nikkei, Apple в сотрудничестве с Taiwan Semiconductor Manufacturing Co. (TSMC) начала работать над созданием технологии micro OLED дисплеев для следующего поколения AR-очков и VR-гарнитур. \n"
  },
  {
    "name": "Facebook и Instagram перестали показывать превью ссылок в Европе",
    "url": "https://habr.com/ru/news/t/541822/",
    "id": "541822",
    "text": "\nИсследователи безопасности Талал Хадж Бакри и Томми Майск сообщили, что Facebook прекратил показ превью ссылок в Messenger и Instagram для пользователей в Европе в соответствии с Европейской директивой о конфиденциальности.  \n"
  },
  {
    "name": "Зонд ОАЭ успешно вышел на орбиту Марса",
    "url": "https://habr.com/ru/news/t/541808/",
    "id": "541808",
    "text": "\nЗонд Al Amal («Надежда») Объединенных Арабских Эмиратов успешно сбросил скорость и вышел на марсианскую орбиту. Аппарат выполнил полностью автоматический маневр запуска на орбиту по графику.  \n"
  },
  {
    "name": "Большой стрим для PHP-разработчиков с Никитой Поповым и другими людьми из сообщества",
    "url": "https://habr.com/ru/company/skyeng/news/t/541756/",
    "id": "541756",
    "text": "\nВ последнюю субботу февраля нас ждет обзор главных событий и явлений в мире PHP в 2020-м и 2021-м, пара докладов и розыгрыш притяных и полезных мелочей для разработчика.\n"
  }
]